''' Модуль для расчета результатов пробы Руфье.

Сумма измерений пульса в трех попытках (до нагрузки, сразу после и после короткого отдыха)
в идеале должна быть не более 200 ударов в минуту. 
Мы предлагаем детям измерять свой пульс на протяжении 15 секунд, 
и приводим результат к ударам в минуту умножением на 4:
    S = 4 * (P1 + P2 + P3)
Чем дальше этот результат от идеальных 200 ударов, тем хуже.
Традиционно таблицы даются для величины, делённой на 10. 

Индекс Руфье   
    IR = (S - 200) / 10
оценивается по таблице в соответствии с возрастом:
        7-8             9-10                11-12               13-14               15+ (только для подростков!)
отл.     < 6.5           < 5                 < 3.5               < 2                 < 0.5  
хор.    >= 6.5 и < 12   >= 5 и < 10.5       >= 3.5 и < 9        >= 2 и < 7.5        >= 0.5 и < 6
удовл.  >= 12 и < 17    >= 10.5 и < 15.5    >= 9 и < 14         >= 7.5 и < 12.5     >= 6 и < 11
слабый  >= 17 и < 21    >= 15.5 и < 19.5    >= 14 и < 18        >= 12.5 и < 16.5    >= 11 и < 15
неуд.   >= 21           >= 19.5             >= 18               >= 16.5             >= 15

для всех возрастов результат "неуд" отстоит от "слабого" на 4, 
тот от "удовлетворительного" на 5, а "хороший" от "уд" - на 5.5

поэтому напишем функцию ruffier_result(r_index, level), которая будет получать
рассчитанный индекс Руфье и уровень "неуд" для возраста тестируемого, и отдавать результат

'''
struct = {
    "ideal": [6.5, 5, 3.5, 2, 0.5],
    "nice": [(6.5, 12), (5, 10.5), (3.5, 9), (2, 7.5), (0.5, 6)],
    "medium": [(12, 17), (10.5, 15.5), (9, 14), (7.5, 12.5), (6, 11)],
    "low": [(17, 21), (15.5, 19.5), (14, 18), (12.5, 16.5), (11, 15)],
    "bad": [21, 19.5, 18, 16.5, 15]
}

# здесь задаются строки, с помощью которых изложен результат:
txt_index = "Ваш индекс Руфье: "
txt_workheart = "Работоспособность сердца: "
txt_nodata = '''
нет данных для такого возраста'''
txt_res = [] 
txt_res.append('''низкая. 
Срочно обратитесь к врачу!''')
txt_res.append('''удовлетворительная. 
Обратитесь к врачу!''')
txt_res.append('''средняя. 
Возможно, стоит дополнительно обследоваться у врача.''')
txt_res.append('''
выше среднего''')
txt_res.append('''
высокая''')

def ruffier_index(P1, P2, P3):
    ''' возвращает значение индекса по трем показателям пульса для сверки с таблицей'''
    return (4 * (P1 + P2 + P3) - 200) / 10

def neud_level(age):
    ''' варианты с возрастом меньше 7 и взрослым надо обрабатывать отдельно, 
    здесь подбираем уровень "неуд" только внутри таблицы:
    в возрасте 7 лет "неуд" - это индекс 21, дальше каждые 2 года он понижается на 1.5 до значения 15 в 15-16 лет '''
    return 21 + int((7 - age) // 2) * 1.5 
    pass

def low_level(age):
    return (17 + int((7 - age) / 2) * 1.5, 21 + int((7 - age) / 2) * 1.5)

def medium_level(age):
    return (12 + int(7 - age) / 2) * 1.5, 17 + int((7 - age) / 2) * 1.5

def good_level(age):
    return (6.5 + int((7 - age) / 2) * 1.5, 12 + int((7 - age) / 2) * 1.5)

def ideal_level(age):
    return 6.5 + int((7 - age) / 2) * 1.5

    
def ruffier_result(r_index, age):
    ''' функция получает индекс Руфье и интерпретирует его, 
    возвращает уровень готовности: число от 0 до 4
    (чем выше уровень готовности, тем лучше).  '''

    if r_index >= neud_level(age):
        # return f"{txt_index}{r_index}\n{txt_workheart}\n{txt_res[0]}"
        return 0
    
    if r_index >= low_level(age)[0] and r_index < low_level(age)[1]:
        # return f"{txt_index}{r_index}\n{txt_workheart}\n{txt_res[1]}"
        return 1

    if r_index >= medium_level(age)[0] and r_index < medium_level(age)[1]:
        return 2

    if r_index >= good_level(age)[0] and r_index < good_level(age)[1]:
        return 3

    if r_index <= ideal_level(age):
        return 4


def test(P1, P2, P3, age):
    ''' эту функцию можно использовать снаружи модуля для подсчетов индекса Руфье.
    Возвращает готовые тексты, которые остается нарисовать в нужном месте
    Использует для текстов константы, заданные в начале этого модуля. '''
    
    r_index = ruffier_index(P1, P2, P3)
    result = ruffier_result(r_index, age)
    if result:
        return f"{txt_index}{r_index}\n{txt_workheart}{txt_res[result]}"
    else:
        return f"Не получилось рассчитать индекс"

